In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "city" :["New york", "Kathmandu", "Tokyo"],
    "temperature" : [20 , 30 , 40]
})

In [3]:
df1

        city  temperature
0   New york           20
1  Kathmandu           30
2      Tokyo           40

In [4]:
df2 = pd.DataFrame({
    "city" :["Delhi" , "Baglung" , "Ohio"],
    "humidity" : [45 , 50 , 60]
})

In [5]:
df2

      city  humidity
0    Delhi        45
1  Baglung        50
2     Ohio        60

In [7]:
df3 = pd.merge(df1 , df2 , on="city")

In [8]:
df3

Empty DataFrame
Columns: [city, temperature, humidity]
Index: []